mkj/imxrt-pacs/svd/MIMXRT1051.svd
        <register>
          <name>SIC</name>
          <description>InterruptClear Register</description>
          <alternateGroup>SIC_SIS</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LockLoss</name>
              <description>SPDIF receiver loss of lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RxFIFOResyn</name>
              <description>Rx FIFO resync</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RxFIFOUnOv</name>
              <description>Rx FIFO underrun/overrun</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UQErr</name>
              <description>U/Q Channel framing error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UQSync</name>
              <description>U/Q Channel sync found</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>QRxOv</name>
              <description>Q Channel receive register overrun</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>URxOv</name>
              <description>U Channel receive register overrun</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BitErr</name>
              <description>SPDIF receiver found parity bit error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SymErr</name>
              <description>SPDIF receiver found illegal symbol</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ValNoGood</name>
              <description>SPDIF validity flag no good</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CNew</name>
              <description>SPDIF receive change in value of control channel</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TxResyn</name>
              <description>SPDIF Tx FIFO resync</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TxUnOv</name>
              <description>SPDIF Tx FIFO under/overrun</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>Lock</name>
              <description>SPDIF receiver's DPLL is locked</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIS</name>
          <description>InterruptStat Register</description>
          <alternateGroup>SIC_SIS</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFIFOFul</name>
              <description>SPDIF Rx FIFO full, can't be cleared with reg. IntClear. To clear it, read from Rx FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TxEm</name>
              <description>SPDIF Tx FIFO empty, can't be cleared with reg. IntClear. To clear it, write toTx FIFO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LockLoss</name>
              <description>SPDIF receiver loss of lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RxFIFOResyn</name>
              <description>Rx FIFO resync</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RxFIFOUnOv</name>
              <description>Rx FIFO underrun/overrun</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UQErr</name>
              <description>U/Q Channel framing error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UQSync</name>
              <description>U/Q Channel sync found</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QRxOv</name>
              <description>Q Channel receive register overrun</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QRxFul</name>
              <description>Q Channel receive register full, can't be cleared with reg</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URxOv</name>
              <description>U Channel receive register overrun</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URxFul</name>
              <description>U Channel receive register full, can't be cleared with reg</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BitErr</name>
              <description>SPDIF receiver found parity bit error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SymErr</name>
              <description>SPDIF receiver found illegal symbol</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ValNoGood</name>
              <description>SPDIF validity flag no good</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNew</name>
              <description>SPDIF receive change in value of control channel</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TxResyn</name>
              <description>SPDIF Tx FIFO resync</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TxUnOv</name>
              <description>SPDIF Tx FIFO under/overrun</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Lock</name>
              <description>SPDIF receiver's DPLL is locked</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRL</name>
          <description>SPDIFRxLeft Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxDataLeft</name>
              <description>Processor receive SPDIF data left</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRR</name>
          <description>SPDIFRxRight Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxDataRight</name>
              <description>Processor receive SPDIF data right</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCSH</name>
          <description>SPDIFRxCChannel_h Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCChannel_h</name>
              <description>SPDIF receive C channel register, contains first 24 bits of C channel without interpretation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCSL</name>
          <description>SPDIFRxCChannel_l Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxCChannel_l</name>
              <description>SPDIF receive C channel register, contains next 24 bits of C channel without interpretation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRU</name>
          <description>UchannelRx Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxUChannel</name>
              <description>SPDIF receive U channel register, contains next 3 U channel bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRQ</name>
          <description>QchannelRx Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxQChannel</name>
              <description>SPDIF receive Q channel register, contains next 3 Q channel bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STL</name>
          <description>SPDIFTxLeft Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxDataLeft</name>
              <description>SPDIF transmit left channel data. It is write-only, and always returns zeros when read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STR</name>
          <description>SPDIFTxRight Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxDataRight</name>
              <description>SPDIF transmit right channel data. It is write-only, and always returns zeros when read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STCSCH</name>
          <description>SPDIFTxCChannelCons_h Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxCChannelCons_h</name>
              <description>SPDIF transmit Cons</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STCSCL</name>
          <description>SPDIFTxCChannelCons_l Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxCChannelCons_l</name>
              <description>SPDIF transmit Cons</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRFM</name>
          <description>FreqMeas Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FreqMeas</name>
              <description>Frequency measurement data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STC</name>
          <description>SPDIFTxClk Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20F00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxClk_DF</name>
              <description>Divider factor (1-128)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TxClk_DF_0</name>
                  <description>divider factor is 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_DF_1</name>
                  <description>divider factor is 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_DF_127</name>
                  <description>divider factor is 128</description>
                  <value>0x7F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>tx_all_clk_en</name>
              <description>Spdif transfer clock enable. When data is going to be transfered, this bit should be set to1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tx_all_clk_en_0</name>
                  <description>disable transfer clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tx_all_clk_en_1</name>
                  <description>enable transfer clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TxClk_Source</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TxClk_Source_0</name>
                  <description>XTALOSC input (XTALOSC clock)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_Source_1</name>
                  <description>tx_clk input (from SPDIF0_CLK_ROOT. See CCM.)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_Source_2</name>
                  <description>tx_clk1 (from SAI1)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_Source_3</name>
                  <description>tx_clk2 SPDIF_EXT_CLK, from pads</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_Source_4</name>
                  <description>tx_clk3 (from SAI2)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_Source_5</name>
                  <description>ipg_clk input (frequency divided)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxClk_Source_6</name>
                  <description>tx_clk4 (from SAI3)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCLK_DF</name>
              <description>system clock divider factor, 2~512.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCLK_DF_0</name>
                  <description>no clock signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK_DF_1</name>
                  <description>divider factor is 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK_DF_511</name>
                  <description>divider factor is 512</description>
                  <value>0x1FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
