mkj/imxrt-pacs/svd/MIMXRT1051.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI2</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x40398000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI2</name>
        <value>33</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI3</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x4039C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI3</name>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI4</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x403A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI4</name>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC_ETC</name>
      <description>ADC_ETC</description>
      <groupName>ADC_ETC</groupName>
      <baseAddress>0x403B0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x150</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_ETC_IRQ0</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ1</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ2</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_ERROR_IRQ</name>
        <value>121</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>ADC_ETC Global Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG_ENABLE</name>
              <description>TRIG enable register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_ENABLE_0</name>
                  <description>disable all 8 external XBAR triggers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_ENABLE_1</name>
                  <description>enable external XBAR trigger0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_ENABLE_2</name>
                  <description>enable external XBAR trigger1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_ENABLE_3</name>
                  <description>enable external XBAR trigger0 and trigger1.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_ENABLE_255</name>
                  <description>enable all 8 external XBAR triggers.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT0_TRIG_ENABLE</name>
              <description>TSC0 TRIG enable register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT0_TRIG_ENABLE_0</name>
                  <description>disable external TSC0 trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT0_TRIG_ENABLE_1</name>
                  <description>enable external TSC0 trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT0_TRIG_PRIORITY</name>
              <description>External TSC0 trigger priority, 7 is highest priority, while 0 is lowest.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT1_TRIG_ENABLE</name>
              <description>TSC1 TRIG enable register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT1_TRIG_ENABLE_0</name>
                  <description>disable external TSC1 trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT1_TRIG_ENABLE_1</name>
                  <description>enable external TSC1 trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT1_TRIG_PRIORITY</name>
              <description>External TSC1 trigger priority, 7 is highest priority, while 0 is lowest.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_DIVIDER</name>
              <description>Pre-divider for trig delay and interval</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_MODE_SEL</name>
              <description>Select the trigger type of the DMA_REQ.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_MODE_SEL_0</name>
                  <description>Trig DMA_REQ with latched signal, REQ will be cleared when ACK and source request cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MODE_SEL_1</name>
                  <description>Trig DMA_REQ with pulsed signal, REQ will be cleared by ACK only.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSC_BYPASS</name>
              <description>TSC Bypass To use ADC2, this bit should be cleared.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSC_BYPASS_0</name>
                  <description>TSC not bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSC_BYPASS_1</name>
                  <description>TSC is bypassed to ADC2, that means TSC will control ADC2 directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFTRST</name>
              <description>Software synchronous reset, active high.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFTRST_0</name>
                  <description>ADC_ETC works normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTRST_1</name>
                  <description>All registers inside ADC_ETC will be reset to the default value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE0_1_IRQ</name>
          <description>ETC DONE0 and DONE1 IRQ State Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG0_DONE0</name>
              <description>TRIG0 done0 interrupt detection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_DONE0_0</name>
                  <description>No TRIG0_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_DONE0_1</name>
                  <description>TRIG0_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_DONE0</name>
              <description>TRIG1 done0 interrupt detection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_DONE0_0</name>
                  <description>No TRIG1_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_DONE0_1</name>
                  <description>TRIG1_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_DONE0</name>
              <description>TRIG2 done0 interrupt detection.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_DONE0_0</name>
                  <description>No TRIG2_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_DONE0_1</name>
                  <description>TRIG2_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG3_DONE0</name>
              <description>TRIG3 done0 interrupt detection.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG3_DONE0_0</name>
                  <description>No TRIG3_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG3_DONE0_1</name>
                  <description>TRIG3_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG4_DONE0</name>
              <description>TRIG4 done0 interrupt detection.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG4_DONE0_0</name>
                  <description>No TRIG4_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG4_DONE0_1</name>
                  <description>TRIG4_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG5_DONE0</name>
              <description>TRIG5 done0 interrupt detection.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG5_DONE0_0</name>
                  <description>No TRIG5_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG5_DONE0_1</name>
                  <description>TRIG5_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG6_DONE0</name>
              <description>TRIG6 done0 interrupt detection.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG6_DONE0_0</name>
                  <description>No TRIG6_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG6_DONE0_1</name>
                  <description>TRIG6_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG7_DONE0</name>
              <description>TRIG7 done0 interrupt detection.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG7_DONE0_0</name>
                  <description>No TRIG7_DONE0 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG7_DONE0_1</name>
                  <description>TRIG7_DONE0 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG0_DONE1</name>
              <description>TRIG0 done1 interrupt detection.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_DONE1_0</name>
                  <description>No TRIG0_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_DONE1_1</name>
                  <description>TRIG0_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_DONE1</name>
              <description>TRIG1 done1 interrupt detection.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_DONE1_0</name>
                  <description>No TRIG1_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_DONE1_1</name>
                  <description>TRIG1_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_DONE1</name>
              <description>TRIG2 done1 interrupt detection.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_DONE1_0</name>
                  <description>No TRIG2_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_DONE1_1</name>
                  <description>TRIG2_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG3_DONE1</name>
              <description>TRIG3 done1 interrupt detection.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG3_DONE1_0</name>
                  <description>No TRIG3_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG3_DONE1_1</name>
                  <description>TRIG3_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG4_DONE1</name>
              <description>TRIG4 done1 interrupt detection.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG4_DONE1_0</name>
                  <description>No TRIG4_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG4_DONE1_1</name>
                  <description>TRIG4_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG5_DONE1</name>
              <description>TRIG5 done1 interrupt detection.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG5_DONE1_0</name>
                  <description>No TRIG5_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG5_DONE1_1</name>
                  <description>TRIG5_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG6_DONE1</name>
              <description>TRIG6 done1 interrupt detection.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG6_DONE1_0</name>
                  <description>No TRIG6_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG6_DONE1_1</name>
                  <description>TRIG6_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG7_DONE1</name>
              <description>TRIG7 done1 interrupt detection.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG7_DONE1_0</name>
                  <description>No TRIG7_DONE1 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG7_DONE1_1</name>
                  <description>TRIG7_DONE1 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
