mkj/imxrt-pacs/svd/MIMXRT1051.svd
        <register>
          <name>CFSR</name>
          <description>Configurable Fault Status Register</description>
          <addressOffset>0xD28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IACCVIOL</name>
              <description>Instruction access violation flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IACCVIOL_0</name>
                  <description>no instruction access violation fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IACCVIOL_1</name>
                  <description>the processor attempted an instruction fetch from a location that does not permit execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACCVIOL</name>
              <description>Data access violation flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DACCVIOL_0</name>
                  <description>no data access violation fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCVIOL_1</name>
                  <description>the processor attempted a load or store at a location that does not permit the operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUNSTKERR</name>
              <description>MemManage fault on unstacking for a return from exception</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUNSTKERR_0</name>
                  <description>no unstacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUNSTKERR_1</name>
                  <description>unstack for an exception return has caused one or more access violations</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTKERR</name>
              <description>MemManage fault on stacking for exception entry</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSTKERR_0</name>
                  <description>no stacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSTKERR_1</name>
                  <description>stacking for an exception entry has caused one or more access violations</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MLSPERR</name>
              <description>MemManage fault occurred during floating-point lazy state preservation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MLSPERR_0</name>
                  <description>No MemManage fault occurred during floating-point lazy state preservation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MLSPERR_1</name>
                  <description>A MemManage fault occurred during floating-point lazy state preservation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMARVALID</name>
              <description>MemManage Fault Address Register (MMFAR) valid flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MMARVALID_0</name>
                  <description>value in MMAR is not a valid fault address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMARVALID_1</name>
                  <description>MMAR holds a valid fault address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBUSERR</name>
              <description>Instruction bus error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBUSERR_0</name>
                  <description>no instruction bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBUSERR_1</name>
                  <description>instruction bus error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRECISERR</name>
              <description>Precise data bus error</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRECISERR_0</name>
                  <description>no precise data bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISERR_1</name>
                  <description>a data bus error has occurred, and the PC value stacked for the exception return points to the instruction that caused the fault</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMPRECISERR</name>
              <description>Imprecise data bus error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMPRECISERR_0</name>
                  <description>no imprecise data bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMPRECISERR_1</name>
                  <description>a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTKERR</name>
              <description>BusFault on unstacking for a return from exception</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSTKERR_0</name>
                  <description>no unstacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNSTKERR_1</name>
                  <description>unstack for an exception return has caused one or more BusFaults</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STKERR</name>
              <description>BusFault on stacking for exception entry</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STKERR_0</name>
                  <description>no stacking fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STKERR_1</name>
                  <description>stacking for an exception entry has caused one or more BusFaults</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSPERR</name>
              <description>Bus fault occurred during floating-point lazy state preservation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSPERR_0</name>
                  <description>No bus fault occurred during floating-point lazy state preservation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSPERR_1</name>
                  <description>A bus fault occurred during floating-point lazy state preservation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFARVALID</name>
              <description>BusFault Address Register (BFAR) valid flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFARVALID_0</name>
                  <description>value in BFAR is not a valid fault address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFARVALID_1</name>
                  <description>BFAR holds a valid fault address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNDEFINSTR</name>
              <description>Undefined instruction UsageFault</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNDEFINSTR_0</name>
                  <description>no undefined instruction UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINSTR_1</name>
                  <description>the processor has attempted to execute an undefined instruction</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVSTATE</name>
              <description>Invalid state UsageFault</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVSTATE_0</name>
                  <description>no invalid state UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVSTATE_1</name>
                  <description>the processor has attempted to execute an instruction that makes illegal use of the EPSR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVPC</name>
              <description>Invalid PC load UsageFault, caused by an invalid PC load by EXC_RETURN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVPC_0</name>
                  <description>no invalid PC load UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVPC_1</name>
                  <description>the processor has attempted an illegal load of EXC_RETURN to the PC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOCP</name>
              <description>No coprocessor UsageFault</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCP_0</name>
                  <description>no UsageFault caused by attempting to access a coprocessor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOCP_1</name>
                  <description>the processor has attempted to access a coprocessor</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNALIGNED</name>
              <description>Unaligned access UsageFault</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNALIGNED_0</name>
                  <description>no unaligned access fault, or unaligned access trapping not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNALIGNED_1</name>
                  <description>the processor has made an unaligned memory access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVBYZERO</name>
              <description>Divide by zero UsageFault</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVBYZERO_0</name>
                  <description>no divide by zero fault, or divide by zero trapping not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBYZERO_1</name>
                  <description>the processor has executed an SDIV or UDIV instruction with a divisor of 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFSR</name>
          <description>HardFault Status register</description>
          <addressOffset>0xD2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VECTTBL</name>
              <description>Indicates a BusFault on a vector table read during exception processing.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VECTTBL_0</name>
                  <description>no BusFault on vector table read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VECTTBL_1</name>
                  <description>BusFault on vector table read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCED</name>
              <description>Indicates a forced hard fault, generated by escalation of a fault with configurable priority that cannot be handles, either because of priority or because it is disabled.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCED_0</name>
                  <description>no forced HardFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCED_1</name>
                  <description>forced HardFault</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUGEVT</name>
              <description>Reserved for Debug use. When writing to the register you must write 0 to this bit, otherwise behavior is Unpredictable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBUGEVT_0</name>
                  <description>No Debug event has occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUGEVT_1</name>
                  <description>Debug event has occurred. The Debug Fault Status Register has been updated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
